backend/load-test.yml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 50
      name: "Warm up phase"
    - duration: 120
      arrivalRate: 50
      name: "Sustained high load (20k user simulation target)"

scenarios:
  - name: "Health Check & Core API Flow"
    flow:
      - get:
          url: "/api/health"
      - think: 1
      - get:
          url: "/api/content/faqs"